veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE30 */
#define IFX_CAN_N_TX_BCIE_CFIE30_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE30 */
#define IFX_CAN_N_TX_BCIE_CFIE30_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE30 */
#define IFX_CAN_N_TX_BCIE_CFIE30_OFF (30u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE31 */
#define IFX_CAN_N_TX_BCIE_CFIE31_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE31 */
#define IFX_CAN_N_TX_BCIE_CFIE31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE31 */
#define IFX_CAN_N_TX_BCIE_CFIE31_OFF (31u)

/** \brief Length for Ifx_CAN_N_TX_EFC_Bits.EFSA */
#define IFX_CAN_N_TX_EFC_EFSA_LEN (14u)

/** \brief Mask for Ifx_CAN_N_TX_EFC_Bits.EFSA */
#define IFX_CAN_N_TX_EFC_EFSA_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_TX_EFC_Bits.EFSA */
#define IFX_CAN_N_TX_EFC_EFSA_OFF (2u)

/** \brief Length for Ifx_CAN_N_TX_EFC_Bits.EFS */
#define IFX_CAN_N_TX_EFC_EFS_LEN (6u)

/** \brief Mask for Ifx_CAN_N_TX_EFC_Bits.EFS */
#define IFX_CAN_N_TX_EFC_EFS_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_TX_EFC_Bits.EFS */
#define IFX_CAN_N_TX_EFC_EFS_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_EFC_Bits.EFWM */
#define IFX_CAN_N_TX_EFC_EFWM_LEN (6u)

/** \brief Mask for Ifx_CAN_N_TX_EFC_Bits.EFWM */
#define IFX_CAN_N_TX_EFC_EFWM_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_TX_EFC_Bits.EFWM */
#define IFX_CAN_N_TX_EFC_EFWM_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_EFS_Bits.EFFL */
#define IFX_CAN_N_TX_EFS_EFFL_LEN (6u)

/** \brief Mask for Ifx_CAN_N_TX_EFS_Bits.EFFL */
#define IFX_CAN_N_TX_EFS_EFFL_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_TX_EFS_Bits.EFFL */
#define IFX_CAN_N_TX_EFS_EFFL_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_EFS_Bits.EFGI */
#define IFX_CAN_N_TX_EFS_EFGI_LEN (5u)

/** \brief Mask for Ifx_CAN_N_TX_EFS_Bits.EFGI */
#define IFX_CAN_N_TX_EFS_EFGI_MSK (0x1fu)

/** \brief Offset for Ifx_CAN_N_TX_EFS_Bits.EFGI */
#define IFX_CAN_N_TX_EFS_EFGI_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_EFS_Bits.EFPI */
#define IFX_CAN_N_TX_EFS_EFPI_LEN (5u)

/** \brief Mask for Ifx_CAN_N_TX_EFS_Bits.EFPI */
#define IFX_CAN_N_TX_EFS_EFPI_MSK (0x1fu)

/** \brief Offset for Ifx_CAN_N_TX_EFS_Bits.EFPI */
#define IFX_CAN_N_TX_EFS_EFPI_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_EFS_Bits.EFF */
#define IFX_CAN_N_TX_EFS_EFF_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_EFS_Bits.EFF */
#define IFX_CAN_N_TX_EFS_EFF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_EFS_Bits.EFF */
#define IFX_CAN_N_TX_EFS_EFF_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_EFS_Bits.TEFL */
#define IFX_CAN_N_TX_EFS_TEFL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_EFS_Bits.TEFL */
#define IFX_CAN_N_TX_EFS_TEFL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_EFS_Bits.TEFL */
#define IFX_CAN_N_TX_EFS_TEFL_OFF (25u)

/** \brief Length for Ifx_CAN_N_TX_EFA_Bits.EFAI */
#define IFX_CAN_N_TX_EFA_EFAI_LEN (5u)

/** \brief Mask for Ifx_CAN_N_TX_EFA_Bits.EFAI */
#define IFX_CAN_N_TX_EFA_EFAI_MSK (0x1fu)

/** \brief Offset for Ifx_CAN_N_TX_EFA_Bits.EFAI */
#define IFX_CAN_N_TX_EFA_EFAI_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_TMC_Bits.TMSA */
#define IFX_CAN_N_TT_TMC_TMSA_LEN (14u)

/** \brief Mask for Ifx_CAN_N_TT_TMC_Bits.TMSA */
#define IFX_CAN_N_TT_TMC_TMSA_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_TT_TMC_Bits.TMSA */
#define IFX_CAN_N_TT_TMC_TMSA_OFF (2u)

/** \brief Length for Ifx_CAN_N_TT_TMC_Bits.TME */
#define IFX_CAN_N_TT_TMC_TME_LEN (7u)

/** \brief Mask for Ifx_CAN_N_TT_TMC_Bits.TME */
#define IFX_CAN_N_TT_TMC_TME_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_TT_TMC_Bits.TME */
#define IFX_CAN_N_TT_TMC_TME_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_RMC_Bits.RID */
#define IFX_CAN_N_TT_RMC_RID_LEN (29u)

/** \brief Mask for Ifx_CAN_N_TT_RMC_Bits.RID */
#define IFX_CAN_N_TT_RMC_RID_MSK (0x1fffffffu)

/** \brief Offset for Ifx_CAN_N_TT_RMC_Bits.RID */
#define IFX_CAN_N_TT_RMC_RID_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_RMC_Bits.XTD */
#define IFX_CAN_N_TT_RMC_XTD_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_RMC_Bits.XTD */
#define IFX_CAN_N_TT_RMC_XTD_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_RMC_Bits.XTD */
#define IFX_CAN_N_TT_RMC_XTD_OFF (30u)

/** \brief Length for Ifx_CAN_N_TT_RMC_Bits.RMPS */
#define IFX_CAN_N_TT_RMC_RMPS_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_RMC_Bits.RMPS */
#define IFX_CAN_N_TT_RMC_RMPS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_RMC_Bits.RMPS */
#define IFX_CAN_N_TT_RMC_RMPS_OFF (31u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.OM */
#define IFX_CAN_N_TT_OCF_OM_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.OM */
#define IFX_CAN_N_TT_OCF_OM_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.OM */
#define IFX_CAN_N_TT_OCF_OM_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.GEN */
#define IFX_CAN_N_TT_OCF_GEN_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.GEN */
#define IFX_CAN_N_TT_OCF_GEN_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.GEN */
#define IFX_CAN_N_TT_OCF_GEN_OFF (3u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.TM */
#define IFX_CAN_N_TT_OCF_TM_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.TM */
#define IFX_CAN_N_TT_OCF_TM_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.TM */
#define IFX_CAN_N_TT_OCF_TM_OFF (4u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.LDSDL */
#define IFX_CAN_N_TT_OCF_LDSDL_LEN (3u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.LDSDL */
#define IFX_CAN_N_TT_OCF_LDSDL_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.LDSDL */
#define IFX_CAN_N_TT_OCF_LDSDL_OFF (5u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.IRTO */
#define IFX_CAN_N_TT_OCF_IRTO_LEN (7u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.IRTO */
#define IFX_CAN_N_TT_OCF_IRTO_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.IRTO */
#define IFX_CAN_N_TT_OCF_IRTO_OFF (8u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.EECS */
#define IFX_CAN_N_TT_OCF_EECS_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.EECS */
#define IFX_CAN_N_TT_OCF_EECS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.EECS */
#define IFX_CAN_N_TT_OCF_EECS_OFF (15u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.AWL */
#define IFX_CAN_N_TT_OCF_AWL_LEN (8u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.AWL */
#define IFX_CAN_N_TT_OCF_AWL_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.AWL */
#define IFX_CAN_N_TT_OCF_AWL_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.EGTF */
#define IFX_CAN_N_TT_OCF_EGTF_LEN (1u)

